src/cf/project/Catalogs/ПрограммыЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПрограммыЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/project/InformationRegisters/ИсторияПрограммЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПрограммЛояльности</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрограмммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКартыЛояльности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/project/Catalogs/ПрограммыЛояльности/Ext/ManagerModule.bsl
Функция ПолучитьПрограммуЛояльности(ВидКарты) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.Скидка КАК Скидка,
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.ПравилаНачисления КАК ПравилаНачисления,
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.ПравилаСписания КАК ПравилаСписания
	|ИЗ
	|	РегистрСведений.ИсторияПрограммЛояльности.СрезПоследних(&Дата, ВидКартыЛояльности = &ВидКартыЛояльности) КАК ИсторияПрограммЛояльностиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());   
	
	Запрос.УстановитьПараметр("ВидКартыЛояльности", ВидКарты);
	
	Результат = Запрос.Выполнить(); 
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Результат.Выгрузить();	
	КонецЕсли;
			
КонецФункции
